In [ ]:
id,department,salary
1,Engineering,75000
2,Marketing,62000
3,HR,58000
5,Finance,67000

In [20]:
my_data = {
    "ids" : [1,2,3,5],
    "department": ["Engineering", "Marketing", "HR", "Finance"],
    "salary": [75000, 62000, 58000, 67000]
}

In [21]:
import pandas as pd

In [31]:
df = pd.DataFrame(my_data)

In [32]:
df

   ids   department  salary
0    1  Engineering   75000
1    2    Marketing   62000
2    3           HR   58000
3    5      Finance   67000

In [33]:
import numpy as np

In [34]:
df["salary"] = np.where(df["salary"] < 65000, 65000, df["salary"])

In [35]:
df

   ids   department  salary
0    1  Engineering   75000
1    2    Marketing   65000
2    3           HR   65000
3    5      Finance   67000